Tekla.Structures.Drawing.FormatTypes
The available format types.

Tekla.Structures.Drawing.FormatTypes.Automatic
Automatic, chooses the most appropriate format for the current environment.

Tekla.Structures.Drawing.FormatTypes.WholeNumber
As shown on the dialog: ###. This format will not show fractions or decimals.

Tekla.Structures.Drawing.FormatTypes.OneDecimalIfValidDecimal
As shown on the dialog: ###.[#]. This format will not show fractions or decimals, unless the rounded decimal part is a non zero value.

Tekla.Structures.Drawing.FormatTypes.OneDecimal
As shown on the dialog: ###.#. This format will always show the value with one decimal.

Tekla.Structures.Drawing.FormatTypes.TwoDecimalsIfValidDecimals
As shown on the dialog: ###.[##]. This format will not show fractions or decimals, unless the rounded decimal part is a non zero value.

Tekla.Structures.Drawing.FormatTypes.TwoDecimals
As shown on the dialog: ###.##. This format will always show the value with two decimals.

Tekla.Structures.Drawing.FormatTypes.ThreeDecimalsIfValidDecimals
As shown on the dialog: ###.[###]. This format will not show fractions or decimals, unless the rounded decimal part is a non zero value.

Tekla.Structures.Drawing.FormatTypes.ThreeDecimals
As shown on the dialog: ###.###. This format will always show the value with three decimals.

Tekla.Structures.Drawing.FormatTypes.Fractional
As shown on the dialog: ### #/#. This format will always show the value with fractions.